# Target guided and ordinal encoding

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'city':['delhi','bombey','surat','baroda','banglore'],
             'price':[150,200,120,300,320]})

In [3]:
df

       city  price
0     delhi    150
1    bombey    200
2     surat    120
3    baroda    300
4  banglore    320

In [6]:
# calculate mean price of each city
mean=df.groupby('city')['price'].mean().to_dict()

In [7]:
df['mean_encoder']=df['city'].map(mean)

In [9]:
df

       city  price  mean_encoder
0     delhi    150         150.0
1    bombey    200         200.0
2     surat    120         120.0
3    baroda    300         300.0
4  banglore    320         320.0